МояКонфа/src/DataProcessors/пр_ИмпортСогласований/пр_ИмпортСогласований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>пр_ИмпортСогласований</name>
</mdclass:DataProcessor>

МояКонфа/src/Enums/СтатусыСогласований/СтатусыСогласований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСогласований</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>СогласованСзамечаниями</name>
  </enumValues>
</mdclass:Enum>

МояКонфа/src/Documents/пр_Согласование/пр_Согласование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пр_Согласование</name>
  <basedOn>Catalog.пр_СогласованиеПрисоединенныеФайлы</basedOn>
  <registerRecords>InformationRegister.пр_СостояниеОборудования</registerRecords>
  <attributes>
    <name>ДатаОбращения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтветаКонтрольная</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтветаФактическая</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СтатусыСогласований</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗДИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>КодОборудования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТехХарактеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>флТехХарактеристика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флКодОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>флНаименование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

МояКонфа/src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/ДополнительныеРеквизитыИСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ДополнительныеРеквизитыИСведения</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.СегментыПартнеров</types>
    <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>CatalogRef.ЗначенияСвойствОбъектовИерархия</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>Boolean</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Файлы</types>
    <types>CatalogRef.Партнеры</types>
    <types>String</types>
    <types>Date</types>
    <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
    <types>CatalogRef.СтраныМира</types>
    <types>Number</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.СегментыНоменклатуры</types>
    <types>CatalogRef.Проекты</types>
    <types>CatalogRef.Склады</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>3</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>Виден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецДополнительныхЗначений</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьВВидеГиперссылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияИспользуются</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияСВесом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доступен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыВыбораЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МногострочноеПолеВвода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСклоненияПредмета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДополнительноеСведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависимостиДополнительныхРеквизитов</name>
    <attributes>
      <name>ЗависимоеСвойство</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

МояКонфа/src/DataProcessors/пр_ИмпортСогласований/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)
	
	ЗагрузкаНаКлиентеOLE();
	
КонецПроцедуры

&НаКлиенте
Функция УбратьСимволы(строка_)
		строка_ = СтрЗаменить(строка_," ","");
		строка_ = СтрЗаменить(строка_,Символы.ПС,"");
		строка_ = СтрЗаменить(строка_,Символы.Таб,"");
		строка_ = СтрЗаменить(строка_,Символы.ВТаб,"");
	
	Возврат строка_;
КонецФункции

  
&НаКлиенте
Процедура ЗагрузкаНаКлиентеOLE()
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
   		Сообщить(ОписаниеОшибки()); 
   		Возврат;
	КонецПопытки;
	
	
	стЗаписываемыеКолонки = Новый Соответствие;
	стЗаписываемыеКолонки.Вставить("№","Номер");
	стЗаписываемыеКолонки.Вставить("Датаобращения","ДатаОбращения");
	стЗаписываемыеКолонки.Вставить("Куратор","Куратор");
	стЗаписываемыеКолонки.Вставить("Датаотправкизаявки","ДатаОтправки");
	стЗаписываемыеКолонки.Вставить("Датаответаконтрольная","ДатаОтветаКонтрольная");
	стЗаписываемыеКолонки.Вставить("Датаответафактическая","ДатаОтветаФактическая");
	стЗаписываемыеКолонки.Вставить("СтатусЗДИ","СтатусЗДИ");

	
	стЗаписываемыеКолонкиТЧТовар = Новый Соответствие;
	стЗаписываемыеКолонкиТЧТовар.Вставить("Наименованиеоборудования","Наименование");
	стЗаписываемыеКолонкиТЧТовар.Вставить("KKS","КодОборудования");
	стЗаписываемыеКолонкиТЧТовар.Вставить("TEC","ТехХарактеристика");

	
	//стЗаписываемыеКолонкиТЧРевизия = Новый Соответствие;
	//стЗаписываемыеКолонкиТЧРевизия.Вставить("QP-Revision","QP_Revision");
	//стЗаписываемыеКолонкиТЧРевизия.Вставить("Ссылка","СсылкаНаПисьмо");
	


	ЭксельКнига = Эксель.Workbooks.Open(ИмяФайла);	
	КоличествоСтраниц = ЭксельКнига.Sheets.Count;
	
	Для НомерЛиста = 1 По КоличествоСтраниц Цикл 
		Лист = ЭксельКнига.Sheets(НомерЛиста);
		КоличествоСтрок = Лист.Cells(1, 1).SpecialCells(11).Row;
		КоличествоКолонок = Лист.Cells(1, 1).SpecialCells(11).Column;
		строкаШапка = Лист.Cells(3, 1) ;
		
		Для НомерСтроки = 4 По КоличествоСтрок Цикл 
			ДанныеСтроки = Новый Структура;
			ДанныеСтрокиТЧтовар = Новый Структура;
		
			
			Для НомерКолонки = 1 По КоличествоКолонок Цикл
				ИмяКолонки1С = стЗаписываемыеКолонки.Получить(УбратьСимволы(строкаШапка.Columns(НомерКолонки).value));
				ИмяКолонки1СТовар = стЗаписываемыеКолонкиТЧТовар.Получить(УбратьСимволы(строкаШапка.Columns(НомерКолонки).value));
				ИмяКолонкиЕкс = строкаШапка.Columns(НомерКолонки).value;
				
				ЗначениеВЯчейке = Лист.Cells(НомерСтроки, строкаШапка.Columns(НомерКолонки).Column).Value;

				Если  ИмяКолонки1С <> Неопределено Тогда
					Если ИмяКолонки1С = "ДатаОбращения" Тогда
						попытка
							ДанныеСтроки.Вставить("Дата",  Дата(ЗначениеВЯчейке));
						Исключение 
							ДанныеСтроки.Вставить("Дата",  ТекущаяДата());
						КонецПопытки;
					КонецЕсли;
					ДанныеСтроки.Вставить(ИмяКолонки1С,  ЗначениеВЯчейке);
				КонецЕсли;
				
				Если  ИмяКолонки1СТовар <> Неопределено Тогда
					ДанныеСтрокиТЧтовар.Вставить(ИмяКолонки1СТовар,  ЗначениеВЯчейке);
				КонецЕсли;
				    
				
			КонецЦикла;
			
			Артикул="";
			ДанныеСтрокиТЧтовар.Свойство("КодОборудования",Артикул);
			Номенклатура = НайтиНоменклатуру(Артикул);
			
			ТехХарактеристика="";
			ДанныеСтрокиТЧтовар.Свойство("ТехХарактеристика",ТехХарактеристика);
			Наименование="";
			ДанныеСтрокиТЧтовар.Свойство("Наименование",Наименование);
			
			ДанныеСтрокиТЧтовар.Вставить("флТехХарактеристика",Не СравнитьДанные(Номенклатура,"флТехХарактеристика",ТехХарактеристика));
			ДанныеСтрокиТЧтовар.Вставить("флКодОборудования",Не СравнитьДанные(Номенклатура,"флКодОборудования",Артикул));
			ДанныеСтрокиТЧтовар.Вставить("флНаименование",Не СравнитьДанные(Номенклатура,"флНаименование",Наименование));
			
			ЗаписатьДокумент(ДанныеСтроки,ДанныеСтрокиТЧтовар);
			//Возврат;
		КонецЦикла;	
		Прервать;
	КонецЦикла;
	
	Эксель.Workbooks.Close();
	Эксель.Application.Quit();
КонецПроцедуры

Функция НайтиНоменклатуру(Артикул)
	
	Возврат Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
	
КонецФункции

Функция СравнитьДанные(Номенклатура,Реквизит,Значение)
	флаг=Ложь;
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат Флаг;
	КонецЕсли;
	
	Если Реквизит = "флТехХарактеристика" Тогда
		Если Номенклатура.пр_ТехническиеХарактеристики=Значение тогда
			флаг = Истина;
		КонецЕсли;
	ИначеЕсли Реквизит = "флКодОборудования" Тогда
		Если Номенклатура.Артикул=Значение тогда
			флаг = Истина;
		КонецЕсли;
	ИначеЕсли Реквизит = "флНаименование" Тогда
		Если Номенклатура.Наименование=Значение тогда
			флаг = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат флаг;
КонецФункции



&НаСервере
Процедура ЗаписатьДокумент(ДанныеСтроки,ДанныеСтрокиТЧтовар)
	
	
	Артикул="";
	ДанныеСтрокиТЧтовар.Свойство("КодОборудования",Артикул);
	Номенклатура = НайтиНоменклатуру(Артикул);
	ДанныеСтрокиТЧтовар.Вставить("Номенклатура",Номенклатура);
	
	
	
	НомерЗаявки="";
	АртикулЗаполнен = ДанныеСтроки.Свойство("Номер",НомерЗаявки);
	ДатаОбращения="";
	АртикулЗаполнен = ДанныеСтроки.Свойство("ДатаОбращения",ДатаОбращения);
	
	
	док = Документы.пр_Согласование.НайтиПоНомеру(НомерЗаявки,ДатаОбращения);
	
	Если Не ЗначениеЗаполнено(док) Тогда
		док = Документы.пр_Согласование.СоздатьДокумент();
	Иначе 
		док = док.ПолучитьОбъект();	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(док.Состояние) Тогда 
		ДанныеСтроки.Вставить("Состояние",Перечисления.СтатусыСогласований.НеСогласован);
	КонецЕсли;
	
	
	ЗаполнитьЗначенияСвойств(док, ДанныеСтроки);
	
	
	Строки = док.Товары.НайтиСтроки(Новый Структура("КодОборудования,Номенклатура",Артикул,Номенклатура));
	Если Строки.Количество() > 0 Тогда
		СтрокаТовары = Строки[0];
	Иначе
		СтрокаТовары = док.Товары.Добавить();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаТовары, ДанныеСтрокиТЧтовар);
	
	
	
	//ПараметрыЗаписи = Новый Структура;
	//ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);
	//ЭтаФорма.Записать(ПараметрыЗаписи);
	док.Записать(РежимЗаписиДокумента.Проведение);				
	Сообщить(СокрЛП(док)+" - загружен.");
	
КонецПроцедуры



&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Документ Excel (*.xls, *.xlsx)|*.xls;*.xlsx";
	Диалог.МножественныйВыбор=Ложь;
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры





















Процедура ЗагрузкаНаКлиентеOLEДоп()
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
   		Сообщить(ОписаниеОшибки()); 
   		Возврат;
	КонецПопытки;
	
	стЗаписываемыеКолонки = Новый Соответствие;
	стЗаписываемыеКолонки.Вставить("NAME","Наименование");
	стЗаписываемыеКолонки.Вставить("KKS","Артикул");

	

	ЭксельКнига = Эксель.Workbooks.Open(ИмяФайла);	
	КоличествоСтраниц = ЭксельКнига.Sheets.Count;
	
	Для НомерЛиста = 1 По КоличествоСтраниц Цикл 
		Лист = ЭксельКнига.Sheets(НомерЛиста);
		КоличествоСтрок = Лист.Cells(1, 1).SpecialCells(11).Row;
		КоличествоКолонок = Лист.Cells(1, 1).SpecialCells(11).Column;
		строкаШапка = Лист.Cells(2, 1) ;
		
		Для НомерСтроки = 3 По КоличествоСтрок Цикл 
			ДанныеСтроки = Новый Структура;
			Для НомерКолонки = 1 По КоличествоКолонок Цикл
				ИмяКолонкиСпр = стЗаписываемыеКолонки.Получить(строкаШапка.Columns(НомерКолонки).value);
				ИмяКолонкиЕкс = строкаШапка.Columns(НомерКолонки).value;
				
				ЗначениеВЯчейке = Лист.Cells(НомерСтроки, строкаШапка.Columns(НомерКолонки).Column).Value;

				Если  ИмяКолонкиСпр <> Неопределено Тогда
					ДанныеСтроки.Вставить(ИмяКолонкиСпр,  ЗначениеВЯчейке);
					ДанныеСтроки.Вставить(СокрЛП(ИмяКолонкиЕкс),  ЗначениеВЯчейке);
				иначе
					попытка
					ДанныеСтроки.Вставить(СокрЛП(ИмяКолонкиЕкс),  ЗначениеВЯчейке);
				Исключение
					Сообщить(ОписаниеОшибки());
					КонецПопытки;
				КонецЕсли;
				
			КонецЦикла;
			
			ЗаписатьНоменклатуруДопРекв(ДанныеСтроки);
			//Возврат;
		КонецЦикла;	
		Прервать;
	КонецЦикла;
	
	Эксель.Workbooks.Close();
	Эксель.Application.Quit();
КонецПроцедуры

&НаСервере
Функция ПоискЗначенияПоКлючу(ст, Ключ, ДляСоответствия=Ложь)
		Если ДляСоответствия Тогда
			Возврат ст[Ключ];
		Иначе
			ЗначениеПоиска = Неопределено;
			ст.Свойство(Ключ,ЗначениеПоиска);
			Возврат ЗначениеПоиска;
		КонецЕсли;
КонецФункции 
		
&НаСервере
Процедура ЗаписатьНоменклатуруДопРекв(ДанныеСтроки)
	  	Артикул="";
	АртикулЗаполнен = ДанныеСтроки.Свойство("Артикул",Артикул);	
	Если Не АртикулЗаполнен Тогда Возврат; КонецЕсли;
	Наименование="";
	ДанныеСтроки.Свойство("Наименование",Наименование);	
	
	
	Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",Артикул);
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
	иначе
		Номенклатура= Номенклатура.Получитьобъект();
	КонецЕсли;
	
	Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(Номенклатура); 

	//ЗаполнитьЗначенияСвойств(Номенклатура, ДанныеСтроки);
	//Номенклатура.Наименование = "Удале_"+Номенклатура.Наименование;
	//Номенклатура.Артикул = "Удале_"+Номенклатура.Артикул;
	Номенклатура.Артикул = Артикул;	
	Номенклатура.Наименование = Наименование;
	Номенклатура.НаименованиеПолное = Наименование;
	Номенклатура.Записать(); 
	
	для Каждого ст Из ДанныеСтроки Цикл 
		если ст.Ключ = "Артикул" или ст.Ключ = "Наименование" Тогда Продолжить;КонецЕсли;

		СоздатьДопРеквизитНаСервере(ст.Ключ);
		ТаблицаСвойств = Новый ТаблицаЗначений;
		ТаблицаСвойств.Колонки.Добавить("Свойство");
		ТаблицаСвойств.Колонки.Добавить("Значение");
		строкаТС = ТаблицаСвойств.Добавить();
		строкаТС.Свойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ст.Ключ);
		//ЗначениеПоиска = Неопределено;
		//ст.Свойство(Ключ,ЗначениеПоиска);
		строкаТС.Значение = ст.Значение;
	

		УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(Номенклатура.Ссылка,ТаблицаСвойств);
		
	КонецЦикла;
	
	
	
	Сообщить(СокрЛП(Номенклатура.Артикул)+" - загружен.");

	
КонецПроцедуры

&НаСервере
Процедура СоздатьДопРеквизитНаСервере(ИмяРеквизита)
	
    //включим константу использования
    Если Не Константы.ИспользоватьДополнительныеРеквизитыИСведения.Получить() Тогда
        Константы.ИспользоватьДополнительныеРеквизитыИСведения.Установить(Истина);
    КонецЕсли;
	
	//попробуем найти реквизит по наименованию
	ДопРеквизитСсылка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(ИмяРеквизита);
	Если НЕ ЗначениеЗаполнено(ДопРеквизитСсылка) Тогда
		//если не нашли реквизит - будем его создавать
		ДопРеквизитОбъект = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		ДопРеквизитОбъект.Заголовок = ИмяРеквизита;
		ДопРеквизитОбъект.НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура;
		ДопРеквизитОбъект.ТипЗначения = Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(250));
		ДопРеквизитОбъект.Наименование = ДопРеквизитОбъект.Заголовок + " ("+ДопРеквизитОбъект.НаборСвойств+")";
		ДопРеквизитОбъект.Виден = Истина;
		ДопРеквизитОбъект.Доступен = Истина;
		ДопРеквизитОбъект.ДополнительныеЗначенияИспользуются = ложь;
		//зададим имя нового реквизита
		//ДопРеквизитОбъект.Имя = "filap_"+СтрЗаменить(ИмяРеквизита," ","");
		ДопРеквизитОбъект.Записать();
		ДопРеквизитСсылка = ДопРеквизитОбъект.Ссылка;		
	КонецЕсли;
	
    //добавим наш реквизит в набор дополнительных реквизитов 
    НаборДополнительныхРеквизитов = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура.ПолучитьОбъект();
    Если НаборДополнительныхРеквизитов.ДополнительныеРеквизиты.Найти(ДопРеквизитСсылка, "Свойство") = Неопределено Тогда
        //добавим реквизит в набор
        Стр = НаборДополнительныхРеквизитов.ДополнительныеРеквизиты.Добавить();
        Стр.Свойство = ДопРеквизитСсылка;
	НаборДополнительныхРеквизитов.Записать();
    КонецЕсли;
	
КонецПроцедуры
